In [72]:
import pandas as pd

In [73]:
df_vente = pd.read_excel('data/Base_OLAP.xlsx', sheet_name='Vente Détail')

df_produit = pd.read_excel('data/Base_OLAP.xlsx', sheet_name='Produits')

df_clients = pd.read_excel('data/Base_OLAP.xlsx', sheet_name='Clients')

df_calendrier = pd.read_excel('data/Base_OLAP.xlsx', sheet_name='Calendrier')

df_employe = pd.read_excel('data/Base_OLAP.xlsx', sheet_name='Employé')

In [74]:
df_vente.head()

,ID_BDD,CUSTOMER_ID,id_employe,EAN,Date achat,ID ticket
0,HZDG8U15NNY7SI6HDK8NMFDEK7MOVUX31VY,CUST-G42Z6WE8QLWJ,b413ca065a762e8cf2e86cfea8b9c174,6473630445822,45518,t_2693
1,1H51BRR800TK9DCIH8M9QCRH3LEAR0JWALJ,CUST-CUA37GP8GABQ,a7ada0770091e838e3dcd45265282820,1857802002765,45518,t_4408
2,W6VNWK6ZX0D4QZ545ZD5Y0THWQQDBTXABXO,CUST-NHWI0DGNESYI,fa836e3f5faf72d24e079235332169ce,6831886714876,45518,t_3258
3,58EC3JD1TDZZAVQZAW4AHFOUEKTR61ZLB70,CUST-IYXDMN7Q11O4,6c1c3292c852c6c593b95cc146b00c0e,6916826750723,45518,t_1080
4,96FE6HA91BRDDF6XRI3O9B83M5PKIXCIXZV,CUST-VR9O54A46EVF,38680e129f45c49322cb12303b7fb655,7930902861368,45518,t_979

In [75]:
df_vente.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41377 entries, 0 to 41376
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID_BDD       41377 non-null  object
 1   CUSTOMER_ID  41377 non-null  object
 2   id_employe   41377 non-null  object
 3   EAN          41377 non-null  int64
 4   Date achat   41377 non-null  int64
 5   ID ticket    41377 non-null  object
dtypes: int64(2), object(4)
memory usage: 1.9+ MB

In [76]:
def str_egal(df,col):
    if df[col].astype('str').str.len().nunique() == 1:
        print(col, ' : toutes les lignes ont le même nombres de caractères. Nombres de caractères', df[col].astype('str').str.len().unique())

    else :
        print(col, ': les lignes ont des longueurs différentes')

In [77]:
for col in df_vente.columns:
    str_egal(df_vente,col)

ID_BDD  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [35]
CUSTOMER_ID  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [17]
id_employe  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [32]
EAN : les lignes ont des longueurs différentes
Date achat  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [5]
ID ticket : les lignes ont des longueurs différentes

In [78]:
for col in df_vente.columns:
    print(col, ': nombre de doublons', df_vente[col].duplicated().sum())

ID_BDD : nombre de doublons 0
CUSTOMER_ID : nombre de doublons 39080
id_employe : nombre de doublons 41321
EAN : nombre de doublons 25231
Date achat : nombre de doublons 41376
ID ticket : nombre de doublons 39569

In [79]:
df_produit.head()

,EAN,categorie,Rayon,Libelle_produit,prix
0,5026767366043,Produits Secs & Conserves,pates,500g penne rigate panzani,1.24
1,1002603715237,Produits Secs & Conserves,pates,500g spaghetti panzani,0.84
2,2113941413715,Produits Secs & Conserves,pates,1kg coquillettes panzani,1.73
3,2597945667827,Produits Secs & Conserves,pates,1kg spaghetti panzani,1.53
4,8046456922921,Produits Secs & Conserves,pates,panzani farfalle 500g,1.22

In [80]:
df_produit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18040 entries, 0 to 18039
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   EAN              18040 non-null  int64
 1   categorie        18040 non-null  object
 2   Rayon            18040 non-null  object
 3   Libelle_produit  18040 non-null  object
 4   prix             18040 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 704.8+ KB

In [81]:
for col in df_produit.columns:
    str_egal(df_produit,col)

EAN : les lignes ont des longueurs différentes
categorie : les lignes ont des longueurs différentes
Rayon : les lignes ont des longueurs différentes
Libelle_produit : les lignes ont des longueurs différentes
prix : les lignes ont des longueurs différentes

In [82]:
df_clients.head()

         CUSTUMER_ID date_inscription
0  CUST-2KYXXXW1NK7I       2023-07-17
1  CUST-NR43XRT2PXYG       2023-09-07
2  CUST-CH58P8PSVIYU       2021-08-24
3  CUST-CI7JQHW4TIYT       2021-12-22
4  CUST-3QHP3KL4NPP2       2020-12-20

In [83]:
for col in df_clients.columns:
    str_egal(df_clients,col)

CUSTUMER_ID  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [17]
date_inscription  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [10]

In [84]:
df_calendrier.head()

    date  annee  mois       Jour mois_nom  annee_mois  jour_semaine trimestre
0  43831   2020     1 1900-01-01  janvier       43831             4        Q1
1  43832   2020     1 1900-01-02  janvier       43831             5        Q1
2  43833   2020     1 1900-01-03  janvier       43831             6        Q1
3  43834   2020     1 1900-01-04  janvier       43831             7        Q1
4  43835   2020     1 1900-01-05  janvier       43831             1        Q1

In [85]:
for col in df_calendrier.columns:
    str_egal(df_calendrier,col)

date  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [5]
annee  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [4]
mois : les lignes ont des longueurs différentes
Jour  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [10]
mois_nom : les lignes ont des longueurs différentes
annee_mois  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [5]
jour_semaine  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [1]
trimestre  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [2]

In [86]:
df_employe.head()

,id_employe,employe,prenom,nom,date_debut,hash_mdp,mail
0,6fa61d0ecae0b563fef18d36b2039c8e,lmaret,Laure,Maret,43961,0373c45921fbaa7530f34b39e71ba93c,lmaret@supersmartmarket.fr
1,37c6a856b2e14217855d808fbc8e56a7,cvérany,Christian,Vérany,43894,3e7956190015a301924fb6d7409665a6,cvérany@supersmartmarket.fr
2,4853b03deab973a1a8e466025bce5b52,sdeslys,Solène,Deslys,44882,45154756438492cd025e3e000781e200,sdeslys@supersmartmarket.fr
3,e44eabec860498a79e675200bc8fa455,acoquelin,Amand,Coquelin,44380,d0575b3bf61100514cedb05d87a9b689,acoquelin@supersmartmarket.fr
4,fa836e3f5faf72d24e079235332169ce,egrosjean,Emmanuel,Grosjean,45192,3a366362e4c0016df16dbd2cfb6c7e2a,egrosjean@supersmartmarket.fr

In [87]:
for col in df_employe.columns:
    str_egal(df_employe,col)

id_employe  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [32]
employe : les lignes ont des longueurs différentes
prenom : les lignes ont des longueurs différentes
nom : les lignes ont des longueurs différentes
date_debut  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [5]
hash_mdp  : toutes les lignes ont le même nombres de caractères. Nombres de caractères [32]
mail : les lignes ont des longueurs différentes

### Préparation table de données

#### Table vente

In [88]:
df_vente.head()

,ID_BDD,CUSTOMER_ID,id_employe,EAN,Date achat,ID ticket
0,HZDG8U15NNY7SI6HDK8NMFDEK7MOVUX31VY,CUST-G42Z6WE8QLWJ,b413ca065a762e8cf2e86cfea8b9c174,6473630445822,45518,t_2693
1,1H51BRR800TK9DCIH8M9QCRH3LEAR0JWALJ,CUST-CUA37GP8GABQ,a7ada0770091e838e3dcd45265282820,1857802002765,45518,t_4408
2,W6VNWK6ZX0D4QZ545ZD5Y0THWQQDBTXABXO,CUST-NHWI0DGNESYI,fa836e3f5faf72d24e079235332169ce,6831886714876,45518,t_3258
3,58EC3JD1TDZZAVQZAW4AHFOUEKTR61ZLB70,CUST-IYXDMN7Q11O4,6c1c3292c852c6c593b95cc146b00c0e,6916826750723,45518,t_1080
4,96FE6HA91BRDDF6XRI3O9B83M5PKIXCIXZV,CUST-VR9O54A46EVF,38680e129f45c49322cb12303b7fb655,7930902861368,45518,t_979

In [89]:
df_vente = df_vente.rename(columns={'ID_BDD':'id_vente','CUSTOMER_ID':'id_client','EAN':'id_produit','Date achat':'id_date','ID ticket':'id_ticket'})

In [90]:
df_vente.to_csv('data/tbl_vente.csv', encoding='utf-8', index=False)

#### Table Produit

In [91]:
df_produit.head()

,EAN,categorie,Rayon,Libelle_produit,prix
0,5026767366043,Produits Secs & Conserves,pates,500g penne rigate panzani,1.24
1,1002603715237,Produits Secs & Conserves,pates,500g spaghetti panzani,0.84
2,2113941413715,Produits Secs & Conserves,pates,1kg coquillettes panzani,1.73
3,2597945667827,Produits Secs & Conserves,pates,1kg spaghetti panzani,1.53
4,8046456922921,Produits Secs & Conserves,pates,panzani farfalle 500g,1.22

In [92]:
df_produit = df_produit.rename(columns={'EAN':'id_produit','Rayon':'rayon','Libelle_produit':'nom_produit','prix':'prix_produit'})

In [93]:
df_produit.to_csv('data/tbl_produit.csv', encoding='utf-8', index=False)

#### Table Employe

In [94]:
df_employe.head()

,id_employe,employe,prenom,nom,date_debut,hash_mdp,mail
0,6fa61d0ecae0b563fef18d36b2039c8e,lmaret,Laure,Maret,43961,0373c45921fbaa7530f34b39e71ba93c,lmaret@supersmartmarket.fr
1,37c6a856b2e14217855d808fbc8e56a7,cvérany,Christian,Vérany,43894,3e7956190015a301924fb6d7409665a6,cvérany@supersmartmarket.fr
2,4853b03deab973a1a8e466025bce5b52,sdeslys,Solène,Deslys,44882,45154756438492cd025e3e000781e200,sdeslys@supersmartmarket.fr
3,e44eabec860498a79e675200bc8fa455,acoquelin,Amand,Coquelin,44380,d0575b3bf61100514cedb05d87a9b689,acoquelin@supersmartmarket.fr
4,fa836e3f5faf72d24e079235332169ce,egrosjean,Emmanuel,Grosjean,45192,3a366362e4c0016df16dbd2cfb6c7e2a,egrosjean@supersmartmarket.fr

In [95]:
df_employe = df_employe.rename(columns={'employe':'pseudo_employe','date_debut':'id_date_debut'})

In [96]:
df_employe.to_csv('data/tbl_employe.csv', encoding='utf-8', index=False)

#### Table Clients

In [97]:
df_clients.head()

         CUSTUMER_ID date_inscription
0  CUST-2KYXXXW1NK7I       2023-07-17
1  CUST-NR43XRT2PXYG       2023-09-07
2  CUST-CH58P8PSVIYU       2021-08-24
3  CUST-CI7JQHW4TIYT       2021-12-22
4  CUST-3QHP3KL4NPP2       2020-12-20

In [98]:
df_clients = df_clients.rename(columns={'CUSTOMER_ID':'id_client'})

In [99]:
df_clients.to_csv('data/tbl_clients.csv', encoding='utf-8', index=False)

#### Table Calendrier

In [100]:
df_calendrier.head()

    date  annee  mois       Jour mois_nom  annee_mois  jour_semaine trimestre
0  43831   2020     1 1900-01-01  janvier       43831             4        Q1
1  43832   2020     1 1900-01-02  janvier       43831             5        Q1
2  43833   2020     1 1900-01-03  janvier       43831             6        Q1
3  43834   2020     1 1900-01-04  janvier       43831             7        Q1
4  43835   2020     1 1900-01-05  janvier       43831             1        Q1

In [101]:
df_calendrier = df_calendrier.rename(columns={'date':'id_date','Jour':'jour','mois_nom':'nom_mois','annee_mois':'id_annee_mois','jour_semaine':'nb_jour'})

In [102]:
df_calendrier['jour'] = df_calendrier['jour'].dt.day

In [103]:
df_calendrier.to_csv('data/tbl_calendrier.csv', encoding='utf-8', index=False)